Revit 2027 API
Application.NewCategorySet Method
Creates a new instance of a set specifically for holding category objects.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CategorySet NewCategorySet()
Public Function NewCategorySet As CategorySet
public:
CategorySet^ NewCategorySet()
member NewCategorySet : unit -> CategorySet
Return Value
CategorySet
A new instance of a Category Set.
Remarks
This type of set is used during the creation of instance and type bindings.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace